aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/cypress/psoc64/libs/mtb-pdl-cat1/drivers/source/cy_crypto_core_sha_v2.c
/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Sha_Start
****************************************************************************//**
*
* Initializes the initial hash vector.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Sha_Start(CRYPTO_Type *base, cy_stc_crypto_sha_state_t *hashState)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    if (hashState != NULL)
    {
        hashState->blockIdx = 0U;
        hashState->messageSize = 0U;

        if (hashState->hashSize != 0U)
        {
            Cy_Crypto_Core_V2_MemCpy(base, hashState->hash, hashState->initialHash, (uint16_t)hashState->hashSize);

            tmpResult = CY_CRYPTO_SUCCESS;
        }
    }

    return (tmpResult);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Sha_Update
****************************************************************************//**
*
* Performs the SHA calculation on one message.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \param message
* The pointer to the message whose Hash is being computed.
*
* \param messageSize
* The size of the message whose Hash is being computed.
*
* \return
* \ref cy_en_crypto_status_t
*
* \note
* This function can be called several times only with message lengths dividable
* by the block size. Only the last call to the function can process a message with
* a not-dividable size.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Sha_Update(CRYPTO_Type *base,
                               cy_stc_crypto_sha_state_t *hashState,
                               uint8_t const *message,
                               uint32_t messageSize)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    if ((hashState != NULL) && (message != NULL))
    {
        if (hashState->blockSize != 0U)
        {
            if (messageSize != 0U)
            {
                hashState->messageSize += messageSize;

                uint32_t hashBlockIdx  = hashState->blockIdx;
                uint32_t hashBlockSize = hashState->blockSize;

                /* Load the calculated hash from the context buffer */
                Cy_Crypto_Core_V2_RBClear(base);
                Cy_Crypto_Core_V2_Sync(base);

                Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_LOAD0, hashState->hash, hashState->hashSize);
                Cy_Crypto_Core_V2_RBXor(base, 0U, hashState->hashSize);
                Cy_Crypto_Core_V2_Sync(base);
                Cy_Crypto_Core_V2_RBSwap(base);

                /* Load the remaining block from the context buffer */
                if (hashBlockIdx != 0U)
                {
                    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_LOAD0, hashState->block, hashBlockIdx);
                    Cy_Crypto_Core_V2_RBXor(base, 0U, hashBlockIdx);
                    Cy_Crypto_Core_V2_Sync(base);
                }

                /* Start the hash calculating */
                Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, message, messageSize);

                /* Processing the fully filled blocks with remaining buffer data */
                while ((hashBlockIdx + messageSize) >= hashBlockSize)
                {
                    uint32_t tempBlockSize = hashBlockSize - hashBlockIdx;

                    Cy_Crypto_Core_V2_RBXor(base, hashBlockIdx, tempBlockSize);

                    Cy_Crypto_Core_V2_Run(base, hashState->modeHw);

                    messageSize -= tempBlockSize;

                    hashBlockIdx = 0U;
                }

                /* The remaining block will be calculated in the Finish function */
                hashState->blockIdx = hashBlockIdx + messageSize;

                /* Load the end of the message (tail that less then block size) to the register buffer */
                if (messageSize != 0U)
                {
                    Cy_Crypto_Core_V2_RBXor(base, hashBlockIdx, messageSize);
                    Cy_Crypto_Core_V2_Sync(base);
                }

                /* Save the remaining data to the context buffer */
                if (hashState->blockIdx != 0U)
                {
                    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, hashState->block, hashState->blockIdx);
                    Cy_Crypto_Core_V2_RBStore(base, 0U, hashState->blockIdx);
                    Cy_Crypto_Core_V2_Sync(base);
                }

                /* Store the calculated hash to the context buffer */
                Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, hashState->hash, hashState->hashSize);
                Cy_Crypto_Core_V2_RBSwap(base);
                Cy_Crypto_Core_V2_RBStore(base, 0U, hashState->hashSize);
                Cy_Crypto_Core_V2_Sync(base);
                Cy_Crypto_Core_V2_RBSwap(base);
            }

            tmpResult = CY_CRYPTO_SUCCESS;
        }
    }

    return (tmpResult);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Sha_Finish
****************************************************************************//**
*
* Completes SHA calculation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \param digest
* The pointer to the calculated hash digest.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Sha_Finish(CRYPTO_Type *base,
                               cy_stc_crypto_sha_state_t *hashState,
                               uint8_t *digest)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    if ((hashState != NULL) && (digest != NULL))
    {
        uint32_t hashBlockSize   = hashState->blockSize;
        uint32_t hashBlockIdx    = hashState->blockIdx;

        uint64_t finalMessageSizeInBits = (uint64_t)hashState->messageSize * 8U;
        uint32_t padSize;

