aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/cypress/psoc64/libs/mtb-pdl-cat1/drivers/source/cy_crypto_core_sha_v2.c
        if (CY_CRYPTO_SHA512_BLOCK_SIZE == hashBlockSize)
        {
            padSize = CY_CRYPTO_SHA512_PAD_SIZE; /* Pad size = 112 */
        }
        else
        {
            padSize = CY_CRYPTO_SHA256_PAD_SIZE; /* Pad size = 56 */
        }

        /* Load the calculated hash from the context buffer */
        Cy_Crypto_Core_V2_RBClear(base);
        Cy_Crypto_Core_V2_Sync(base);

        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_LOAD0, hashState->hash, hashState->hashSize);
        Cy_Crypto_Core_V2_RBXor(base, 0U, hashState->hashSize);
        Cy_Crypto_Core_V2_Sync(base);
        Cy_Crypto_Core_V2_RBSwap(base);

        /* Load the end of the message (tail that less then block size) to the register buffer */
        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_LOAD0, hashState->block, hashBlockIdx);
        Cy_Crypto_Core_V2_RBXor(base, 0U, hashBlockIdx);

        /* Sync until XOR operation is completed */
        Cy_Crypto_Core_V2_Sync(base);

        /* Append 1 bit to the end of the message */
        Cy_Crypto_Core_V2_RBSetByte(base, hashBlockIdx, 0x80U);

        if (hashBlockIdx >= padSize)
        {
            Cy_Crypto_Core_V2_Run(base, hashState->modeHw);
            Cy_Crypto_Core_V2_Sync(base);
        }

        /* Append message size into last of the block */

        /* In case of u32SizeInByte * 8 > u32Max */
        Cy_Crypto_Core_V2_RBSetByte(base, hashBlockSize - 5U, (uint8_t)(finalMessageSizeInBits >> 32U));

        Cy_Crypto_Core_V2_RBSetByte(base, hashBlockSize - 4U, (uint8_t)(finalMessageSizeInBits >> 24U));
        Cy_Crypto_Core_V2_RBSetByte(base, hashBlockSize - 3U, (uint8_t)(finalMessageSizeInBits >> 16U));
        Cy_Crypto_Core_V2_RBSetByte(base, hashBlockSize - 2U, (uint8_t)(finalMessageSizeInBits >> 8U));
        Cy_Crypto_Core_V2_RBSetByte(base, hashBlockSize - 1U, (uint8_t)(finalMessageSizeInBits));

        Cy_Crypto_Core_V2_Run(base, hashState->modeHw);
        Cy_Crypto_Core_V2_Sync(base);

        /* Write digest. */
        Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, digest, hashState->digestSize);
        Cy_Crypto_Core_V2_RBSwap(base);
        Cy_Crypto_Core_V2_RBStore(base, 0U, hashState->digestSize);

        Cy_Crypto_Core_V2_FFStoreSync(base);

        tmpResult = CY_CRYPTO_SUCCESS;
    }

    return (tmpResult);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Sha_Free
****************************************************************************//**
*
* Clears the used memory buffers.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \return
* \ref cy_en_crypto_status_t
*
* *******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Sha_Free(CRYPTO_Type *base, cy_stc_crypto_sha_state_t *hashState)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    if (hashState != NULL)
    {
        /* Clears the context buffers */
        Cy_Crypto_Core_V2_MemSet(base, hashState->block, 0x00U, (uint16_t)hashState->blockSize);
        Cy_Crypto_Core_V2_MemSet(base, hashState->hash,  0x00U, (uint16_t)hashState->hashSize);

        /* Clears the hash state */
        Cy_Crypto_Core_V2_MemSet(base, hashState, 0x00U, (uint16_t)sizeof(cy_stc_crypto_sha_state_t));

        /* Clears the memory buffer. */
        Cy_Crypto_Core_V2_RBClear(base);
        Cy_Crypto_Core_V2_Sync(base);

        tmpResult = CY_CRYPTO_SUCCESS;
    }

    return (tmpResult);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Sha
****************************************************************************//**
*
* Performs the SHA Hash function.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param mode
* \ref cy_en_crypto_sha_mode_t
*
* \param message
* The pointer to a message whose hash value is being computed.
*
* \param messageSize
* The size of a message.
*
* \param digest
* The pointer to the hash digest.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Sha(CRYPTO_Type *base,
                                uint8_t const *message,
                                uint32_t messageSize,
                                uint8_t *digest,
                                cy_en_crypto_sha_mode_t mode)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    /* Allocate maximal space for the structure which stores the SHA buffers */
    cy_stc_crypto_v2_sha512_buffers_t shaBuffers = {{ 0 }, { 0 }};

    /* Allocate space for the structure which stores the SHA context */
    cy_stc_crypto_sha_state_t hashState = { 0 };

    /* No buffers are needed for the Crypto_ver2 IP block. */
    tmpResult = Cy_Crypto_Core_V2_Sha_Init   (base, &hashState, mode, &shaBuffers);

    if (CY_CRYPTO_SUCCESS == tmpResult)
    {
        tmpResult = Cy_Crypto_Core_V2_Sha_Start  (base, &hashState);
    }
    if (CY_CRYPTO_SUCCESS == tmpResult)
    {
        tmpResult = Cy_Crypto_Core_V2_Sha_Update (base, &hashState, message, messageSize);
    }
    if (CY_CRYPTO_SUCCESS == tmpResult)
    {
        tmpResult = Cy_Crypto_Core_V2_Sha_Finish (base, &hashState, digest);
    }
    if (CY_CRYPTO_SUCCESS == tmpResult)
    {
        tmpResult = Cy_Crypto_Core_V2_Sha_Free   (base, &hashState);
    }

    return (tmpResult);
}


#endif /* #if (CPUSS_CRYPTO_SHA == 1) */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXCRYPTO */


/* [] END OF FILE */
